In [13]:
import pandas as pd

data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [3]:
employee_uni

   id  unique_id
0   3          1
1  11          2
2  90          3

Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

Return the result table in any order.

The result format is in the following example.

| unique_id | name     |
|-----------|----------|
| null      | Alice    |
| null      | Bob      |
| 2         | Meir     |
| 3         | Winston  |
| 1         | Jonathan |

In [15]:
pd.merge(left=employees, right=employee_uni, how="left", left_on="id", right_on="id")[["name", "unique_id"]]

       name  unique_id
0     Alice        NaN
1       Bob        NaN
2      Meir        2.0
3   Winston        3.0
4  Jonathan        1.0

In [16]:
employees.merge(right=employee_uni,on="id",how="left")[["name", "unique_id"]]

   id      name  unique_id
0   1     Alice        NaN
1   7       Bob        NaN
2  11      Meir        2.0
3  90   Winston        3.0
4   3  Jonathan        1.0